{"Command":"-iL <inputfilename>","Description":{"Description":"Input from list of hosts\/networks","Details":"Specify a file containing a list of hosts or networks to scan."},"Processed_Description":"description input list detail specify file containing list host network scan"}
{"Command":"-iR <num hosts>","Description":{"Description":"Choose random targets","Details":"Select a specified number of random targets for scanning."},"Processed_Description":"description choose random target detail select specified number random target scanning"}
{"Command":"--exclude <host1[,host2][,host3],...>","Description":{"Description":"Exclude hosts\/networks","Details":"Exclude specific hosts or networks from the scan."},"Processed_Description":"description exclude detail exclude specific host network scan"}
{"Command":"--excludefile <exclude_file>","Description":{"Description":"Exclude list from file","Details":"Exclude hosts or networks listed in a file from the scan."},"Processed_Description":"description exclude list file detail exclude host network listed file scan"}
{"Command":"-sL","Description":{"Description":"List Scan - simply list targets to scan","Details":"Perform a simple listing of targets without scanning them."},"Processed_Description":"description list scan simply list target scan detail perform simple listing target without scanning"}
{"Command":"-sn","Description":{"Description":"Ping Scan - disable port scan","Details":"Perform a ping scan without attempting to discover open ports."},"Processed_Description":"description ping scan disable port scan detail perform ping scan without attempting discover open port"}
{"Command":"-Pn","Description":{"Description":"Treat all hosts as online -- skip host discovery","Details":"Bypass host discovery and treat all specified hosts as online."},"Processed_Description":"description treat host online skip host discovery detail bypass host discovery treat specified host online"}
{"Command":"-PS\/PA\/PU\/PY[portlist]","Description":{"Description":"TCP SYN, TCP ACK, UDP or SCTP discovery to given ports","Details":"Send TCP SYN,  TCP ACK,  UDP  or SCTP discovery probes to specified ports."},"Processed_Description":"description tcp syn tcp ack udp sctp discovery given port detail send tcp syn tcp ack udp sctp discovery probe specified port"}
{"Command":"-PE","Description":{"Description":"ICMP echo, timestamp, and netmask request discovery probes","Details":"Send ICMP echo,  timestamp  and netmask request discovery probes."},"Processed_Description":"description icmp echo timestamp netmask request discovery probe detail send icmp echo timestamp netmask request discovery probe"}
{"Command":"-PO[protocol list]","Description":{"Description":"IP Protocol Ping","Details":"Send IP protocol ping probes using the specified protocols."},"Processed_Description":"description ip protocol ping detail send ip protocol ping probe using specified protocol"}
{"Command":"-n\/-R","Description":{"Description":"Never do DNS resolution\/Always resolve [default: sometimes]","Details":"Control DNS resolution behavior during scanning."},"Processed_Description":"description never dns resolve default sometimes detail control dns resolution behavior scanning"}
{"Command":"--dns-servers <serv1[,serv2],...>","Description":{"Description":"Specify custom DNS servers","Details":"Use custom DNS servers for name resolution during scanning."},"Processed_Description":"description specify custom dns server detail use custom dns server name resolution scanning"}
{"Command":"--system-dns","Description":{"Description":"Use OS's DNS resolver","Details":"Use the operating system's default DNS resolver for name resolution."},"Processed_Description":"description use o dns resolver detail use operating system default dns resolver name resolution"}
{"Command":"--traceroute","Description":{"Description":"Trace hop path to each host","Details":"Perform a traceroute to each scanned host to show the path taken."},"Processed_Description":"description trace hop path host detail perform traceroute scanned host show path taken"}
{"Command":"-sS\/sT\/sA\/sW\/sM","Description":{"Description":"TCP SYN\/Connect()\/ACK\/Window\/Maimon scans","Details":"Perform different types of TCP scans: SYN,  Connect,  ACK,  Window,  Maimon."},"Processed_Description":"description tcp scan detail perform different type tcp scan syn connect ack window maimon"}
{"Command":"-sU","Description":{"Description":"UDP Scan","Details":"Perform a scan to discover open UDP ports."},"Processed_Description":"description udp scan detail perform scan discover open udp port"}
{"Command":"-sN\/sF\/sX","Description":{"Description":"TCP Null, FIN, and Xmas scans","Details":"Perform TCP scans with Null,  FIN  or Xmas flags set."},"Processed_Description":"description tcp null fin xmas scan detail perform tcp scan null fin xmas flag set"}
{"Command":"--scanflags <flags>","Description":{"Description":"Customize TCP scan flags","Details":"Specify custom TCP scan flags."},"Processed_Description":"description customize tcp scan flag detail specify custom tcp scan flag"}
{"Command":"-sI <zombie host[","Description":{"Description":"probeport]>: Idle scan","Details":"Perform an idle scan using a specified zombie host and optional probe port."},"Processed_Description":"description probeport idle scan detail perform idle scan using specified zombie host optional probe port"}
{"Command":"-sY\/sZ","Description":{"Description":"SCTP INIT\/COOKIE-ECHO scans","Details":"Perform SCTP INIT or COOKIE-ECHO scans."},"Processed_Description":"description sctp scan detail perform sctp init scan"}
{"Command":"-sO","Description":{"Description":"IP protocol scan","Details":"Perform a scan to determine which IP protocols are supported by hosts."},"Processed_Description":"description ip protocol scan detail perform scan determine ip protocol supported host"}
{"Command":"-b <FTP relay host>","Description":{"Description":"FTP bounce scan","Details":"Perform an FTP bounce scan through a specified relay host."},"Processed_Description":"description ftp bounce scan detail perform ftp bounce scan specified relay host"}
{"Command":"-p <port ranges>","Description":{"Description":"Only scan specified ports","Details":"Limit scanning to specified port ranges."},"Processed_Description":"description scan specified port detail limit scanning specified port range"}
{"Command":"--exclude-ports <port ranges>","Description":{"Description":"Exclude the specified ports from scanning","Details":"Skip scanning of specific ports."},"Processed_Description":"description exclude specified port scanning detail skip scanning specific port"}
{"Command":"-F","Description":{"Description":"Fast mode - Scan fewer ports than the default scan","Details":"Perform a faster scan by reducing the number of scanned ports."},"Processed_Description":"description fast mode scan fewer port default scan detail perform faster scan reducing number scanned port"}
{"Command":"-r","Description":{"Description":"Scan ports sequentially - don't randomize","Details":"Scan ports in sequential order without randomization."},"Processed_Description":"description scan port sequentially randomize detail scan port sequential order without randomization"}
{"Command":"--top-ports <number>","Description":{"Description":"Scan <number> most common ports","Details":"Limit scanning to the specified number of most common ports."},"Processed_Description":"description scan number common port detail limit scanning specified number common port"}
{"Command":"--port-ratio <ratio>","Description":{"Description":"Scan ports more common than <ratio>","Details":"Specify a ratio to determine which ports to scan based on commonality."},"Processed_Description":"description scan port common ratio detail specify ratio determine port scan based commonality"}
{"Command":"-sV","Description":{"Description":"Probe open ports to determine service\/version info","Details":"Detect services and their versions on open ports."},"Processed_Description":"description probe open port determine info detail detect service version open port"}
{"Command":"--version-intensity <level>","Description":{"Description":"Set from 0 (light) to 9 (try all probes)","Details":"Control the intensity of service\/version detection probes."},"Processed_Description":"description set light try probe detail control intensity detection probe"}
{"Command":"--version-light","Description":{"Description":"Limit to most likely probes (intensity 2)","Details":"Limit service\/version detection to probes deemed most likely."},"Processed_Description":"description limit likely probe intensity detail limit detection probe deemed likely"}
{"Command":"--version-all","Description":{"Description":"Try every single probe (intensity 9)","Details":"Attempt every possible service\/version detection probe."},"Processed_Description":"description try every single probe intensity detail attempt every possible detection probe"}
{"Command":"--version-trace","Description":{"Description":"Show detailed version scan activity (for debugging)","Details":"Display detailed information about service\/version detection probes."},"Processed_Description":"description show detailed version scan activity debugging detail display detailed information detection probe"}
{"Command":"-sC","Description":{"Description":"equivalent to --script=default","Details":"Enable default NSE scripts for scripting engine scanning."},"Processed_Description":"description equivalent detail enable default nse script scripting engine scanning"}
{"Command":"--script=<Lua scripts>","Description":{"Description":"<Lua scripts> is a comma separated list of","Details":"Specify Lua scripts to execute during scanning."},"Processed_Description":"description lua script comma separated list detail specify lua script execute scanning"}
{"Command":"--script-args=<n1=v1,[n2=v2,...]>","Description":{"Description":"provide arguments to scripts","Details":"Pass arguments to NSE scripts during execution."},"Processed_Description":"description provide argument script detail pas argument nse script execution"}
{"Command":"--script-args-file=filename","Description":{"Description":"provide NSE script args in a file","Details":"Specify a file containing arguments for NSE scripts."},"Processed_Description":"description provide nse script args file detail specify file containing argument nse script"}
{"Command":"--script-trace","Description":{"Description":"Show all data sent and received","Details":"Display all data sent and received during NSE script execution."},"Processed_Description":"description show data sent received detail display data sent received nse script execution"}
{"Command":"--script-updatedb","Description":{"Description":"Update the script database","Details":"Update the NSE script database with the latest version."},"Processed_Description":"description update script database detail update nse script database latest version"}
{"Command":"--script-help=<Lua scripts>","Description":{"Description":"Show help about scripts","Details":"Display help information for specified Lua scripts."},"Processed_Description":"description show help script detail display help information specified lua script"}
{"Command":"-A","Description":{"Description":"Enable OS detection, version detection, script scanning, and traceroute","Details":"Enable comprehensive scanning including OS detection, version detection,  script scanning,  and traceroute functionality."},"Processed_Description":"description enable o detection version detection script scanning traceroute detail enable comprehensive scanning including o detection version detection script scanning traceroute functionality"}
{"Command":"--osscan-limit","Description":{"Description":"Limit OS detection to promising targets","Details":"Restrict OS detection to targets showing promising results."},"Processed_Description":"description limit o detection promising target detail restrict o detection target showing promising result"}
{"Command":"--osscan-guess","Description":{"Description":"Guess OS more aggressively","Details":"Increase aggressiveness of OS detection guessing."},"Processed_Description":"description guess o aggressively detail increase aggressiveness o detection guessing"}
{"Command":"-T<0-5>","Description":{"Description":"Set timing template (higher is faster)","Details":"Select a timing template for scan speed and reliability."},"Processed_Description":"description set timing template higher faster detail select timing template scan speed reliability"}
{"Command":"--min-hostgroup\/max-hostgroup <size>","Description":{"Description":"Parallel host scan group sizes","Details":"Control the size of parallel host scan groups."},"Processed_Description":"description parallel host scan group size detail control size parallel host scan group"}
{"Command":"--min-parallelism\/max-parallelism <numprobes>","Description":{"Description":"Probe parallelization","Details":"Specify the number of probes to run in parallel during scanning."},"Processed_Description":"description probe parallelization detail specify number probe run parallel scanning"}
{"Command":"--min-rtt-timeout\/max-rtt-timeout\/initial-rtt-timeout <time>","Description":{"Description":"Specifies timeout values for round-trip time during scanning.","Details":""},"Processed_Description":"description specifies timeout value time scanning detail"}
{"Command":"--max-retries <tries>","Description":{"Description":"Caps number of port scan probe retransmissions","Details":"Limit the number of retransmissions for port scan probes."},"Processed_Description":"description cap number port scan probe retransmissions detail limit number retransmissions port scan probe"}
{"Command":"--host-timeout <time>","Description":{"Description":"Give up on target after this long","Details":"Specify a timeout duration after which scanning a target is aborted."},"Processed_Description":"description give target long detail specify timeout duration scanning target aborted"}
{"Command":"--scan-delay\/--max-scan-delay <time>","Description":{"Description":"Adjust delay between probes","Details":"Set a delay between scan probes  with optional maximum delay."},"Processed_Description":"description adjust delay probe detail set delay scan probe optional maximum delay"}
{"Command":"--min-rate <number>","Description":{"Description":"Send packets no slower than <number> per second","Details":"Set a minimum rate for sending packets during scanning."},"Processed_Description":"description send packet slower number per second detail set minimum rate sending packet scanning"}
{"Command":"--max-rate <number>","Description":{"Description":"Send packets no faster than <number> per second","Details":"Set a maximum rate for sending packets during scanning."},"Processed_Description":"description send packet faster number per second detail set maximum rate sending packet scanning"}
{"Command":"-f; --mtu <val>","Description":{"Description":"fragment packets (optionally w\/given MTU)","Details":"Fragment packets during scanning,  optionally specifying MTU size."},"Processed_Description":"description fragment packet optionally mtu detail fragment packet scanning optionally specifying mtu size"}
{"Command":"-D <decoy1,decoy2[,ME],...>","Description":{"Description":"Cloak a scan with decoys","Details":"Conduct a scan using decoy IP addresses to hide the origin."},"Processed_Description":"description cloak scan decoy detail conduct scan using decoy ip address hide origin"}
{"Command":"-S <IP_Address>","Description":{"Description":"Spoof source address","Details":"Use a specified IP address as the source address for scan packets."},"Processed_Description":"description spoof source address detail use specified ip address source address scan packet"}
{"Command":"-e <iface>","Description":{"Description":"Use specified interface","Details":"Select a specific network interface for sending scan packets."},"Processed_Description":"description use specified interface detail select specific network interface sending scan packet"}
{"Command":"-g\/--source-port <portnum>","Description":{"Description":"Use given port number","Details":"Specify a particular source port number for scan packets."},"Processed_Description":"description use given port number detail specify particular source port number scan packet"}
{"Command":"--proxies <url1,[url2],...>","Description":{"Description":"Relay connections through HTTP\/SOCKS4 proxies","Details":"Route scan connections through specified HTTP or SOCKS4 proxies."},"Processed_Description":"description relay connection proxy detail route scan connection specified http proxy"}
{"Command":"--data <hex string>","Description":{"Description":"Append a custom payload to sent packets","Details":"Include a custom hexadecimal payload in packets sent during scanning."},"Processed_Description":"description append custom payload sent packet detail include custom hexadecimal payload packet sent scanning"}
{"Command":"--data-string <string>","Description":{"Description":"Append a custom ASCII string to sent packets","Details":"Append a custom ASCII string to packets sent during scanning."},"Processed_Description":"description append custom ascii string sent packet detail append custom ascii string packet sent scanning"}
{"Command":"--data-length <num>","Description":{"Description":"Append random data to sent packets","Details":"Include random data in packets sent during scanning,  up to a specified length."},"Processed_Description":"description append random data sent packet detail include random data packet sent scanning specified length"}
{"Command":"--ip-options <options>","Description":{"Description":"Send packets with specified ip options","Details":"Include specified IP options in packets sent during scanning."},"Processed_Description":"description send packet specified ip option detail include specified ip option packet sent scanning"}
{"Command":"--ttl <val>","Description":{"Description":"Set IP time-to-live field","Details":"Set the Time-To-Live (TTL) value in IP packets sent during scanning."},"Processed_Description":"description set ip field detail set ttl value ip packet sent scanning"}
{"Command":"--spoof-mac <mac address\/prefix\/vendor name>","Description":{"Description":"Spoof your MAC address","Details":"Use a specified MAC address or prefix as the source MAC address for scan packets."},"Processed_Description":"description spoof mac address detail use specified mac address prefix source mac address scan packet"}
{"Command":"--badsum","Description":{"Description":"Send packets with a bogus TCP\/UDP\/SCTP checksum","Details":"Send packets with an intentionally incorrect TCP, UDP or SCTP checksum during scanning."},"Processed_Description":"description send packet bogus checksum detail send packet intentionally incorrect tcp udp sctp checksum scanning"}
{"Command":"-oN\/-oX\/-oS\/-oG <file>","Description":{"Description":"Output scan in normal, XML, s|<rIpt kIddi3,Output scan results in one or more formats: normal, XML, s|<rIpt kIddi3,\r\n-oA <basename>,Output in the three major formats at once,Generate output in all major formats: normal, XML, and s|<rIpt kIddi3,\r\n-v,Increase verbosity level (use -vv or more for greater effect),Increase verbosity level to show more detailed scan information.\r\n-d,Increase debugging level (use -dd or more for greater effect),Increase debugging level to provide extensive debug information.\r\n--reason,Display the reason a port is in a particular state,Show the reason why a port is in a specific state during scanning.\r\n--open,Only show open (or possibly open) ports,Display only open or possibly open ports in scan results.\r\n--packet-trace,Show all packets sent and received,Log and display all packets sent and received during scanning.\r\n--iflist,Print host interfaces and routes (for debugging),Print information about host interfaces and routes for debugging purposes.\r\n--append-output,Append to rather than clobber specified output files,Append scan results to specified output files instead of overwriting them.\r\n--resume <filename>,Resume an aborted scan,Resume a previously interrupted scan using a specified resume file.\r\n--noninteractive,Disable runtime interactions via keyboard,Disable interactive prompts and interactions during scanning.\r\n--stylesheet <path\/URL>,XSL stylesheet to transform XML output to HTML,Use an XSL stylesheet to convert XML scan output into HTML format.\r\n--webxml,Reference stylesheet from Nmap.Org for more portable XML,Reference Nmap.Org's stylesheet for more portable XML scan output.\r\n--no-stylesheet,Prevent associating of XSL stylesheet w\/XML output,Disable association of any XSL stylesheet with XML scan output.\r\n-6,Enable IPv6 scanning,Enable scanning of IPv6 addresses and networks.\r\n-A,Enable OS detection","Details":" version detection,  script scanning,  and traceroute, Enable comprehensive scanning including OS detection  version detection  script scanning  and traceroute functionality."},"Processed_Description":"description output scan normal xml ript output scan result one format normal xml ript basename output three major format generate output major format normal xml ript increase verbosity level use greater effect increase verbosity level show detailed scan increase debugging level use greater effect increase debugging level provide extensive debug reason display reason port particular state show reason port specific state open show open possibly open port display open possibly open port scan show packet sent received log display packet sent received iflist print host interface route debugging print information host interface route debugging append rather clobber specified output file append scan result specified output file instead overwriting resume filename resume aborted scan resume previously interrupted scan using specified resume noninteractive disable runtime interaction via keyboard disable interactive prompt interaction stylesheet xsl stylesheet transform xml output html use xsl stylesheet convert xml scan output html webxml reference stylesheet portable xml reference stylesheet portable xml scan prevent associating xsl stylesheet output disable association xsl stylesheet xml scan enable scanning enable scanning address enable o detection detail version detection script scanning traceroute enable comprehensive scanning including o detection version detection script scanning traceroute functionality"}
{"Command":"--datadir <dirname>","Description":{"Description":"Specify custom Nmap data file location","Details":"Set a custom directory location for Nmap data files."},"Processed_Description":"description specify custom nmap data file location detail set custom directory location nmap data file"}
{"Command":"--send-eth\/--send-ip","Description":{"Description":"Send using raw ethernet frames or IP packets","Details":"Choose to send packets using raw Ethernet frames or IP packets."},"Processed_Description":"description send using raw ethernet frame ip packet detail choose send packet using raw ethernet frame ip packet"}
{"Command":"--privileged","Description":{"Description":"Assume that the user is fully privileged","Details":"Assume full privileges for scan operations (requires root\/administrator access)."},"Processed_Description":"description assume user fully privileged detail assume full privilege scan operation requires access"}
{"Command":"--unprivileged","Description":{"Description":"Assume the user lacks raw socket privileges","Details":"Assume limited privileges for scan operations."},"Processed_Description":"description assume user lack raw socket privilege detail assume limited privilege scan operation"}
{"Command":"-V","Description":{"Description":"Print version number","Details":"Display the current version number of Nmap."},"Processed_Description":"description print version number detail display current version number nmap"}
{"Command":"-h","Description":{"Description":"Print this help summary page","Details":"Display a summary of available Nmap command-line options."},"Processed_Description":"description print help summary page detail display summary available nmap option"}
{"Command":"--interactive","Description":{"Description":"Enable interactive mode (if supported)","Details":"Enable interactive mode for user input and interaction."},"Processed_Description":"description enable interactive mode supported detail enable interactive mode user input interaction"}
{"Command":"--insecure","Description":{"Description":"Disable SSL\/TLS validation","Details":"Disable SSL\/TLS certificate validation for HTTPS-based services."},"Processed_Description":"description disable validation detail disable certificate validation service"}
{"Command":"--cert <certfile>","Description":{"Description":"Use specified SSL certificate","Details":"Use a specified SSL certificate for SSL\/TLS connections."},"Processed_Description":"description use specified ssl certificate detail use specified ssl certificate connection"}
{"Command":"--key <keyfile>","Description":{"Description":"Use specified SSL key","Details":"Use a specified SSL key for SSL\/TLS connections."},"Processed_Description":"description use specified ssl key detail use specified ssl key connection"}
{"Command":"--cipher <cipherlist>","Description":{"Description":"Specify SSL ciphers","Details":"Specify a list of SSL ciphers for SSL\/TLS connections."},"Processed_Description":"description specify ssl cipher detail specify list ssl cipher connection"}
{"Command":"--http-useragent <agent>","Description":{"Description":"Set the User-Agent for HTTP requests","Details":"Specify a custom User-Agent header for HTTP requests."},"Processed_Description":"description set http request detail specify custom header http request"}
{"Command":"--http-referer <url>","Description":{"Description":"Set the Referer for HTTP requests","Details":"Specify a custom Referer header for HTTP requests."},"Processed_Description":"description set referer http request detail specify custom referer header http request"}
{"Command":"--http-method <method>","Description":{"Description":"Set the HTTP method to use","Details":"Specify the HTTP method (GET,  POST,  etc.) for HTTP requests."},"Processed_Description":"description set http method use detail specify http method get post etc http request"}
{"Command":"--http-host <host>","Description":{"Description":"Set the Host header for HTTP requests","Details":"Specify the Host header for HTTP requests."},"Processed_Description":"description set host header http request detail specify host header http request"}
{"Command":"--http-cookie <cookie>","Description":{"Description":"Set the Cookie header for HTTP requests","Details":"Specify the Cookie header for HTTP requests."},"Processed_Description":"description set cookie header http request detail specify cookie header http request"}
{"Command":"--http-auth <type>","Description":{"Description":"Set the HTTP authentication type (basic, digest,  ntlm)","Details":" Specify the type of HTTP authentication (basic,  digest,  NTLM)."},"Processed_Description":"description set http authentication type basic digest ntlm detail specify type http authentication basic digest ntlm"}
{"Command":"--http-auth-cred <username:password>","Description":{"Description":"Set the HTTP authentication credentials","Details":"Provide credentials for HTTP authentication (username:password)."},"Processed_Description":"description set http authentication credential detail provide credential http authentication username password"}
{"Command":"--sslcert <certfile>","Description":{"Description":"Use the specified SSL certificate","Details":"Use the specified SSL certificate for SSL\/TLS connections."},"Processed_Description":"description use specified ssl certificate detail use specified ssl certificate connection"}
{"Command":"--sslkey <keyfile>","Description":{"Description":"Use the specified SSL key","Details":"Use the specified SSL key for SSL\/TLS connections."},"Processed_Description":"description use specified ssl key detail use specified ssl key connection"}
{"Command":"--sslciphers <cipherlist>","Description":{"Description":"Specify the SSL ciphers to use","Details":"Specify a list of SSL ciphers for SSL\/TLS connections."},"Processed_Description":"description specify ssl cipher use detail specify list ssl cipher connection"}
{"Command":"--sslproto <protocol>","Description":{"Description":"Specify the SSL protocol to use (TLSv1.2,  TLSv1.3)","Details":"Specify the SSL\/TLS protocol version to use (e.g.  TLSv1.2,  TLSv1.3)."},"Processed_Description":"description specify ssl protocol use detail specify protocol version use"}
{"Command":"--proxy <url>","Description":{"Description":"Relay connections through a proxy server","Details":"Route connections through a specified HTTP or SOCKS4 proxy server."},"Processed_Description":"description relay connection proxy server detail route connection specified http proxy server"}
{"Command":"--proxy-auth <username:password>","Description":{"Description":"Set proxy authentication credentials","Details":"Provide credentials for proxy server authentication (username:password)."},"Processed_Description":"description set proxy authentication credential detail provide credential proxy server authentication username password"}
{"Command":"--user-agent <agent>","Description":{"Description":"Set the User-Agent header","Details":"Specify a custom User-Agent header for HTTP requests."},"Processed_Description":"description set header detail specify custom header http request"}
{"Command":"--referer <url>","Description":{"Description":"Set the Referer header","Details":"Specify a custom Referer header for HTTP requests."},"Processed_Description":"description set referer header detail specify custom referer header http request"}
{"Command":"--custom-header <header:value>","Description":{"Description":"Set a custom HTTP header","Details":"Specify a custom HTTP header in the format \"header:value\"."},"Processed_Description":"description set custom http header detail specify custom http header format header"}
{"Command":"--follow-redirects","Description":{"Description":"Follow HTTP redirects","Details":"Automatically follow HTTP redirects during scanning."},"Processed_Description":"description follow http redirects detail automatically follow http redirects scanning"}
{"Command":"--max-redirects <num>","Description":{"Description":"Specify the maximum number of redirects to follow","Details":"Limit the number of HTTP redirects to follow during scanning."},"Processed_Description":"description specify maximum number redirects follow detail limit number http redirects follow scanning"}
{"Command":"--timeout <time>","Description":{"Description":"Set the timeout for connections","Details":"Specify the timeout duration for establishing connections."},"Processed_Description":"description set timeout connection detail specify timeout duration establishing connection"}
{"Command":"--connect-timeout <time>","Description":{"Description":"Set the timeout for establishing connections","Details":"Specify the timeout duration for establishing connections."},"Processed_Description":"description set timeout establishing connection detail specify timeout duration establishing connection"}
{"Command":"--retry <num>","Description":{"Description":"Set the number of retries for failed connections","Details":"Specify the number of retries for failed connections."},"Processed_Description":"description set number retries failed connection detail specify number retries failed connection"}
{"Command":"--retry-delay <time>","Description":{"Description":"Set the delay between retries","Details":"Specify the delay duration between retry attempts for failed connections."},"Processed_Description":"description set delay retries detail specify delay duration retry attempt failed connection"}
{"Command":"--retry-backoff <factor>","Description":{"Description":"Set the backoff factor for retries","Details":"Specify the backoff factor for exponential backoff retries."},"Processed_Description":"description set backoff factor retries detail specify backoff factor exponential backoff retries"}
{"Command":"--retry-jitter <time>","Description":{"Description":"Set the jitter for retries","Details":"Specify the jitter amount for introducing randomness in retry delays."},"Processed_Description":"description set jitter retries detail specify jitter amount introducing randomness retry delay"}
{"Command":"--retry-on <statuscodes>","Description":{"Description":"Retry on specified HTTP status codes","Details":"Specify HTTP status codes on which to retry failed connections."},"Processed_Description":"description retry specified http status code detail specify http status code retry failed connection"}
{"Command":"--disable-keepalive","Description":{"Description":"Disable HTTP keep-alive","Details":"Disable HTTP keep-alive connections during scanning."},"Processed_Description":"description disable http detail disable http connection scanning"}
{"Command":"--disable-http2","Description":{"Description":"Disable HTTP\/2 support","Details":"Disable HTTP\/2 protocol support for HTTP requests."},"Processed_Description":"description disable support detail disable protocol support http request"}
{"Command":"--http2-prior-knowledge","Description":{"Description":"Use HTTP\/2 without HTTP\/1.1 upgrade","Details":"Start using HTTP\/2 protocol immediately without upgrading from HTTP\/1.1."},"Processed_Description":"description use without upgrade detail start using protocol immediately without upgrading"}
{"Command":"--http2-settings <settings>","Description":{"Description":"Set HTTP\/2 settings","Details":"Specify custom settings for HTTP\/2 protocol."},"Processed_Description":"description set setting detail specify custom setting protocol"}
{"Command":"--http2-disable-push","Description":{"Description":"Disable HTTP\/2 push","Details":"Disable support for HTTP\/2 server push for HTTP requests."},"Processed_Description":"description disable push detail disable support server push http request"}
{"Command":"--http2-window-size <size>","Description":{"Description":"Set the HTTP\/2 window size","Details":"Specify the initial HTTP\/2 window size for flow control."},"Processed_Description":"description set window size detail specify initial window size flow control"}
{"Command":"--http2-headers-table-size <size>","Description":{"Description":"Set the maximum HTTP\/2 headers table size","Details":"Specify the maximum size of the HTTP\/2 headers table for compression."},"Processed_Description":"description set maximum header table size detail specify maximum size header table compression"}
{"Command":"--http2-max-concurrent-streams <num>","Description":{"Description":"Set the maximum number of concurrent streams","Details":"Specify the maximum number of HTTP\/2 concurrent streams to allow."},"Processed_Description":"description set maximum number concurrent stream detail specify maximum number concurrent stream allow"}
{"Command":"--http2-max-frame-size <size>","Description":{"Description":"Set the maximum HTTP\/2 frame size","Details":"Specify the maximum size of HTTP\/2 frames."},"Processed_Description":"description set maximum frame size detail specify maximum size frame"}
{"Command":"--http2-max-header-list-size <size>","Description":{"Description":"Set the maximum HTTP\/2 header list size","Details":"Specify the maximum size of HTTP\/2 header lists."},"Processed_Description":"description set maximum header list size detail specify maximum size header list"}
{"Command":"--http2-initial-window-size <size>","Description":{"Description":"Set the initial HTTP\/2 window size","Details":"Specify the initial window size for HTTP\/2 connections."},"Processed_Description":"description set initial window size detail specify initial window size connection"}
{"Command":"--http2-max-header-table-size <size>","Description":{"Description":"Set the maximum HTTP\/2 header table size","Details":"Specify the maximum size of the HTTP\/2 header compression table."},"Processed_Description":"description set maximum header table size detail specify maximum size header compression table"}
{"Command":"--http2-enable-push","Description":{"Description":"Enable HTTP\/2 push","Details":"Enable support for HTTP\/2 server push for HTTP requests."},"Processed_Description":"description enable push detail enable support server push http request"}
{"Command":"-6","Description":{"Description":"Enable IPv6 scanning","Details":"Enable scanning of IPv6 addresses and networks."},"Processed_Description":"description enable scanning detail enable scanning address network"}
